#include <iostream>
#include <util.h>

// На языке С/С++ стандартными средствами используемой системы программирования написать параллельное приложение,
// создающее 3 дополнительных вычислительных потока – 2 «писателя» и 1 «читатель», выполняющих обмен информацией
// через буфер длины 10. Для простоты под пересылаемой информацией можно понимать целые числа – 1й и 2й потоки их
// генерируют и записывают в буфер каждый со своей скоростью, 3й поток читает и выводит на экран.

int main() {
    std::cout << "Hello, World!" << std::endl;
    std::cout << test() << std::endl;
    return 0;
}
